Reports/20191017_114611/TestSuite1/20191017_114611/requests/main/0.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2019-10-17T06:16:36.077Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://www.dneonline.com/calculator.asmx?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <Add xmlns=\"http://tempuri.org/\">\n            <intA>5</intA>\n            <intB>6</intB>\n        </Add>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 326,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><AddResponse xmlns=\"http://tempuri.org/\"><AddResult>11</AddResult></AddResponse></soap:Body></soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 183,
        "bodySize" : 326,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "connect" : 2789,
        "ssl" : -1,
        "send" : 0,
        "wait" : 0,
        "receive" : 0,
        "dns" : -1,
        "blocked" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "0",
        "testObjectId" : "Object Repository/CaluclatorSoapService/Addition",
        "harId" : "5536760e-b673-459d-8492-11dc5e2d9905",
        "reportFolder" : null
      },
      "time" : 2789
    } ],
    "comment" : ""
  }
}